R1#sh run
Building configuration...

Current configuration : 1560 bytes
!
version 15.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R1
!
boot-start-marker
boot-end-marker
!
!
enable secret 5 $1$qisU$SiLC53dCwNNdLO1GZ1wQ9/
!
no aaa new-model
clock timezone UTS 3 0
mmi polling-interval 60
no mmi auto-configure
no mmi pvc
mmi snmp-timeout 180
!
!
!
!
!
!
!
!


!
ip dhcp excluded-address 192.168.1.65 192.168.1.70
!
ip dhcp pool CLIENTS
 network 192.168.1.64 255.255.255.192
 default-router 192.168.1.65
 domain-name ccna-lab.com
 lease 2 12 30
!
!
!
no ip domain lookup
ip cef
no ipv6 cef
!
multilink bundle-name authenticated
!
password encryption aes
!
!
!
!
!
!
!
username loggin secret 5 $1$HlBi$pBFOagrlBrU3jOFOwlG9l.
!
redundancy
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
interface Ethernet0/0
 description Link_TO_RT2
 ip address 10.0.0.1 255.255.255.252
!
interface Ethernet0/1
 no ip address
!
interface Ethernet0/1.100
 encapsulation dot1Q 100
 ip address 192.168.1.65 255.255.255.224
!
interface Ethernet0/1.200
 encapsulation dot1Q 200
 ip address 192.168.1.1 255.255.255.192
!
interface Ethernet0/1.1000
 encapsulation dot1Q 1000
!
interface Ethernet0/2
 no ip address
!
interface Ethernet0/2.1000
 encapsulation dot1Q 1000
!
interface Ethernet0/3
 no ip address
!
ip forward-protocol nd
!
!
no ip http server
no ip http secure-server
ip route 0.0.0.0 0.0.0.0 10.0.0.2
!
!
!
!
control-plane
!
!
!
!
!
!
!
banner motd ^C***ONLY AUTH USERS***^C
!
line con 0
 logging synchronous
 login local
line aux 0
line vty 0 4
 login local
 transport input none
!
!
end

R1#
R1# sh ip dh
R1# sh ip dhcp ?
  binding   DHCP address bindings
  conflict  DHCP address conflicts
  database  DHCP database agents
  import    Show Imported Parameters
  pool      DHCP pools information
  relay     Miscellaneous DHCP relay information
  server    Miscellaneous DHCP server information

R1# sh ip dhcp poo
R1# sh ip dhcp pool CLIENTS ?
  |  Output modifiers
  <cr>

R1#sh ip dhcp pool CLIENTS

Pool CLIENTS :
 Utilization mark (high/low)    : 100 / 0
 Subnet size (first/next)       : 0 / 0
 Total addresses                : 62
 Leased addresses               : 2
 Pending event                  : none
 1 subnet is currently in the pool :
 Current index        IP address range                    Leased addresses
 192.168.1.73         192.168.1.65     - 192.168.1.126     2